#### Topics to be covered today
- Summary
- CrossTab
- Pivot

In [16]:
#import pandas library and provide alias name as pd
import pandas as pd
import numpy as np

#job_data = pd.read_csv('../Data/DataAnalyst.csv')
# Data downloaded from https://www.kaggle.com/andrewmvd/data-analyst-jobs?select=DataAnalyst.csv
#job_data.head()

job_data = pd.DataFrame({'Gender': ['M', 'F', 'M', 'F', 'M', 'M', 'F', 'F', 'M', 'M', 'F', 'M', 'M'], 
               'Age': [30, 40, 40, 25, 25, 25, 30, 30, 30, 40, 25, 30, 40],
               'JobTitle': ['Data Analyst', 'Data Engineer', 'Data Analyst', 'Data Scientist', 'Data Scientist', 'Data Scientist', 'Data Analyst', 'Data Engineer', 'Data Scientist', 'Data Engineer', 'Data Scientist', 'Data Analyst', 'Data Engineer'],
                'Salary': [100000, 150000, 150000, 100000, 130000, 150000, 130000, 150000, 150000, 150000, 100000, 130000, 130000],
                'Rating': [5, 6, 5, 7, 7, 7, 6, 6, 7, 8, 5, 4, 7],
                'CompanySize': [100, 100, 100, 1000, 1000, 1000, 1000, 1000, 100, 5000, 5000, 5000, 5000]})

In [17]:
job_data.head()

  Gender  Age        JobTitle  Salary  Rating  CompanySize
0      M   30    Data Analyst  100000       5          100
1      F   40   Data Engineer  150000       6          100
2      M   40    Data Analyst  150000       5          100
3      F   25  Data Scientist  100000       7         1000
4      M   25  Data Scientist  130000       7         1000

1a. Summary of a Column in a dataframe

In [18]:
job_data.Age.describe()

count    13.000000
mean     31.538462
std       6.253204
min      25.000000
25%      25.000000
50%      30.000000
75%      40.000000
max      40.000000
Name: Age, dtype: float64

1b. Finding mean of a column

In [19]:
job_data.Age.mean()

31.53846153846154

1c. Finding uniques values in a column

In [20]:
job_data.JobTitle.unique()

array(['Data Analyst', 'Data Engineer', 'Data Scientist'], dtype=object)

1d. Finding number of occurrence of values in a column

In [21]:
job_data.JobTitle.value_counts()

Data Scientist    5
Data Engineer     4
Data Analyst      4
Name: JobTitle, dtype: int64

1e. Finding summary of column with certain data types

In [24]:
#job_data.describe(include=['float'])
job_data.describe(include=['object'])

       Gender        JobTitle
count      13              13
unique      2               3
top         M  Data Scientist
freq        8               5

1f. Finding summary on the whole dataset

In [25]:
job_data.describe()

             Age         Salary     Rating  CompanySize
count  13.000000      13.000000  13.000000    13.000000
mean   31.538462  132307.692308   6.153846  1953.846154
std     6.253204   20475.125622   1.143544  2148.881641
min    25.000000  100000.000000   4.000000   100.000000
25%    25.000000  130000.000000   5.000000   100.000000
50%    30.000000  130000.000000   6.000000  1000.000000
75%    40.000000  150000.000000   7.000000  5000.000000
max    40.000000  150000.000000   8.000000  5000.000000

1g. Summary by including all the stats.

In [26]:
job_data.describe(include='all')

,Gender,Age,JobTitle,Salary,Rating,CompanySize
count,13,13.000000,13,13.000000,13.000000,13.000000
unique,2,NaN,3,NaN,NaN,NaN
top,M,NaN,Data Scientist,NaN,NaN,NaN
freq,8,NaN,5,NaN,NaN,NaN
mean,NaN,31.538462,NaN,132307.692308,6.153846,1953.846154
std,NaN,6.253204,NaN,20475.125622,1.143544,2148.881641
min,NaN,25.000000,NaN,100000.000000,4.000000,100.000000
25%,NaN,25.000000,NaN,130000.000000,5.000000,100.000000
50%,NaN,30.000000,NaN,130000.000000,6.000000,1000.000000
75%,NaN,40.000000,NaN,150000.000000,7.000000,5000.000000
max,NaN,40.000000,NaN,150000.000000,8.000000,5000.000000

2a. Cross Tab

In [27]:
pd.crosstab(job_data['Rating'], job_data['Gender'])

Gender  F  M
Rating
4       0  1
5       1  2
6       3  0
7       1  4
8       0  1

2b. CrossTab using dot notation

In [28]:
pd.crosstab(job_data.Rating, job_data.CompanySize)

CompanySize  100   1000  5000
Rating
4               0     0     1
5               2     0     1
6               1     2     0
7               1     3     1
8               0     0     1

2c. Transposing a CrossTab

In [29]:
pd.crosstab(job_data.Rating, job_data.Gender).T

Rating  4  5  6  7  8
Gender
F       0  1  3  1  0
M       1  2  0  4  1

2d. CrossTab to get percentages

In [30]:
pd.crosstab(job_data.Rating, job_data.Gender).apply(lambda r: (r/len(job_data))*100, axis=1)

Gender          F          M
Rating
4        0.000000   7.692308
5        7.692308  15.384615
6       23.076923   0.000000
7        7.692308  30.769231
8        0.000000   7.692308

3a. Pivot

In [31]:
pd.pivot_table(job_data, index=['Gender', 'Rating'], values='Salary', aggfunc='mean')

                      Salary
Gender Rating
F      5       100000.000000
       6       143333.333333
       7       100000.000000
M      4       130000.000000
       5       125000.000000
       7       140000.000000
       8       150000.000000

In [33]:
pd.pivot_table(job_data, index='JobTitle', columns=['Salary', 'Rating'], aggfunc='mean')

                  Age                                                    \
Salary         100000       130000             150000
Rating              5     7      4     6     7      5     6     7     8
JobTitle
Data Analyst     30.0   NaN   30.0  30.0   NaN   40.0   NaN   NaN   NaN
Data Engineer     NaN   NaN    NaN   NaN  40.0    NaN  35.0   NaN  40.0
Data Scientist   25.0  25.0    NaN   NaN  25.0    NaN   NaN  27.5   NaN

               CompanySize                                                \
Salary              100000          130000                 150000
Rating                   5       7       4       6       7      5      6
JobTitle
Data Analyst         100.0     NaN  5000.0  1000.0     NaN  100.0    NaN
Data Engineer          NaN     NaN     NaN     NaN  5000.0    NaN  550.0
Data Scientist      5000.0  1000.0     NaN     NaN  1000.0    NaN    NaN


Salary
Rating              7       8
JobTitle
Data Analyst      NaN     NaN
Data Engineer     NaN  5000.0
Data Scientist  550.0     NaN

Difference between Cross Tab and Pivot
- Pivot Table expects data to be in dataframe format while not the case with CrossTab
- If you look into the source code of crosstab, you will understand that it takes data as input converts it into dataframe and then call pivot table
- So if you have an dataframe then directly call Pivot Table oherwise use crosstab

#### To Try
- Perform cross tabulation and pivot table on Age and Gender and aggregate the Salary
- Bucket the salaries in different buckets like less than 100K, 100-125K and so on as required and do a crosstab for this new column with gender and rating
- Re-execute the script for the customer data avaiable in kaggle - https://www.kaggle.com/shrutimechlearn/customer-data